import Images, { ImagesProps } from '../images/images';
import styles from './aditya-hridayam-strotam.module.css';

/* eslint-disable-next-line */
export interface AdityaHridayamStrotamProps {}

export function AdityaHridayamStrotam(props: AdityaHridayamStrotamProps) {
  return (
    <div className={styles['container']}>
      <Images src="../../assets/Suryadev.jpg" title="Suryadev"></Images>

      <div className={styles['header']}>Aditya Hridayam Strotam </div>

      <div className={styles['body']}>
        <div> ॥ विनियोग ॥ </div>
        <div>ॐ अस्य आदित्यह्रदय स्तोत्रस्य </div>
        <div>अगस्त्यऋषि: अनुष्टुप्छन्दः आदित्यह्रदयभूतो</div>
        <div>भगवान् ब्रह्मा देवता निरस्ताशेषविघ्नतया </div>
        <div>ब्रह्माविद्यासिद्धौ सर्वत्र जयसिद्धौ च विनियोगः</div>
        <br />
        <div>पूर्व पिठिता</div>
        <br />
        <div>ततो युद्धपरिश्रान्तं समरे चिन्तया स्थितम्‌ ।</div>
        <div>रावणं चाग्रतो दृष्ट्वा युद्धाय समुपस्थितम्‌ ॥1॥</div>
        <div>दैवतैश्च समागम्य द्रष्टुमभ्यागतो रणम्‌ ।</div>
        <div>उपगम्याब्रवीद् राममगस्त्यो भगवांस्तदा ॥2॥</div>
        <div>राम राम महाबाहो श्रृणु गुह्मं सनातनम्‌ ।</div>
        <div>येन सर्वानरीन्‌ वत्स समरे विजयिष्यसे ॥3॥</div>
        <div>आदित्यहृदयं पुण्यं सर्वशत्रुविनाशनम्‌ ।</div>
        <div>जयावहं जपं नित्यमक्षयं परमं शिवम्‌ ॥4॥</div>
        <div>सर्वमंगलमागल्यं सर्वपापप्रणाशनम्‌ ।</div>
        <div>चिन्ताशोकप्रशमनमायुर्वर्धनमुत्तमम्‌ ॥5॥</div>
        <br />
        <div>मूल-स्तोत्र </div>
        <div>रश्मिमन्तं समुद्यन्तं देवासुरनमस्कृतम्‌ ।</div>
        <div>पुजयस्व विवस्वन्तं भास्करं भुवनेश्वरम्‌ ॥6॥</div>
        <div>सर्वदेवात्मको ह्येष तेजस्वी रश्मिभावन: ।</div>
        <div>एष देवासुरगणांल्लोकान्‌ पाति गभस्तिभि: ॥7॥</div>
        <div>एष ब्रह्मा च विष्णुश्च शिव: स्कन्द: प्रजापति: ।</div>
        <div>महेन्द्रो धनद: कालो यम: सोमो ह्यापां पतिः ॥8॥</div>
        <div>पितरो वसव: साध्या अश्विनौ मरुतो मनु: ।</div>
        <div>वायुर्वहिन: प्रजा प्राण ऋतुकर्ता प्रभाकर: ॥9॥</div>
        <div>आदित्य: सविता सूर्य: खग: पूषा गभस्तिमान्‌ ।</div>
        <div>सुवर्णसदृशो भानुर्हिरण्यरेता दिवाकर: ॥10॥</div>
        <div>हरिदश्व: सहस्त्रार्चि: सप्तसप्तिर्मरीचिमान्‌ ।</div>
        <div>तिमिरोन्मथन: शम्भुस्त्वष्टा मार्तण्डकोंऽशुमान्‌ ॥11॥</div>
        <div>हिरण्यगर्भ: शिशिरस्तपनोऽहस्करो रवि: ।</div>
        <div>अग्निगर्भोऽदिते: पुत्रः शंखः शिशिरनाशन: ॥12॥</div>
        <div>व्योमनाथस्तमोभेदी ऋग्यजु:सामपारग: ।</div>
        <div>घनवृष्टिरपां मित्रो विन्ध्यवीथीप्लवंगमः ॥13॥</div>
        <div>आतपी मण्डली मृत्यु: पिगंल: सर्वतापन:।</div>
        <div>कविर्विश्वो महातेजा: रक्त:सर्वभवोद् भव: ॥14॥</div>
        <div>नक्षत्रग्रहताराणामधिपो विश्वभावन: ।</div>
        <div>तेजसामपि तेजस्वी द्वादशात्मन्‌ नमोऽस्तु ते ॥15॥</div>
        <div>नम: पूर्वाय गिरये पश्चिमायाद्रये नम: ।</div>
        <div>ज्योतिर्गणानां पतये दिनाधिपतये नम: ॥16॥</div>
        <div>जयाय जयभद्राय हर्यश्वाय नमो नम: ।</div>
        <div>नमो नम: सहस्त्रांशो आदित्याय नमो नम: ॥17॥</div>
        <div>नम उग्राय वीराय सारंगाय नमो नम: ।</div>
        <div>नम: पद्मप्रबोधाय प्रचण्डाय नमोऽस्तु ते ॥18॥</div>
        <div>ब्रह्मेशानाच्युतेशाय सुरायादित्यवर्चसे ।</div>
        <div>भास्वते सर्वभक्षाय रौद्राय वपुषे नम: ॥19॥</div>
        <div>तमोघ्नाय हिमघ्नाय शत्रुघ्नायामितात्मने ।</div>
        <div>कृतघ्नघ्नाय देवाय ज्योतिषां पतये नम: ॥20॥</div>
        <div>तप्तचामीकराभाय हरये विश्वकर्मणे ।</div>
        <div>नमस्तमोऽभिनिघ्नाय रुचये लोकसाक्षिणे ॥21॥</div>
        <div>नाशयत्येष वै भूतं तमेष सृजति प्रभु: ।</div>
        <div>पायत्येष तपत्येष वर्षत्येष गभस्तिभि: ॥22॥</div>
        <div>एष सुप्तेषु जागर्ति भूतेषु परिनिष्ठित: ।</div>
        <div>एष चैवाग्निहोत्रं च फलं चैवाग्निहोत्रिणाम्‌ ॥23॥</div>
        <div>देवाश्च क्रतवश्चैव क्रतुनां फलमेव च ।</div>
        <div>यानि कृत्यानि लोकेषु सर्वेषु परमं प्रभु: ॥24॥</div>
        <div>एनमापत्सु कृच्छ्रेषु कान्तारेषु भयेषु च ।</div>
        <div>कीर्तयन्‌ पुरुष: कश्चिन्नावसीदति राघव ॥25॥</div>
        <div>पूजयस्वैनमेकाग्रो देवदेवं जगप्ततिम्‌ ।</div>
        <div>एतत्त्रिगुणितं जप्त्वा युद्धेषु विजयिष्यसि ॥26॥</div>
        <div>अस्मिन्‌ क्षणे महाबाहो रावणं त्वं जहिष्यसि ।</div>
        <div>एवमुक्ता ततोऽगस्त्यो जगाम स यथागतम्‌ ॥27॥</div>
        <div>एतच्छ्रुत्वा महातेजा नष्टशोकोऽभवत्‌ तदा ।</div>
        <div>धारयामास सुप्रीतो राघव प्रयतात्मवान्‌ ॥28॥</div>
        <div>आदित्यं प्रेक्ष्य जप्त्वेदं परं हर्षमवाप्तवान्‌ ।</div>
        <div>त्रिराचम्य शूचिर्भूत्वा धनुरादाय वीर्यवान्‌ ॥29॥</div>
        <div>रावणं प्रेक्ष्य हृष्टात्मा जयार्थं समुपागतम्‌ ।</div>
        <div>सर्वयत्नेन महता वृतस्तस्य वधेऽभवत्‌ ॥30॥</div>
        <div>अथ रविरवदन्निरीक्ष्य रामं मुदितमना: परमं प्रहृष्यमाण: ।</div>
        <div>निशिचरपतिसंक्षयं विदित्वा सुरगणमध्यगतो वचस्त्वरेति ॥31॥</div>
      </div>
    </div>
  );
}

export default AdityaHridayamStrotam;
