import styles from './nakoda-bhairav-chalisa.module.css';

/* eslint-disable-next-line */
export interface NakodaBhairavChalisaProps {}

export function NakodaBhairavChalisa(props: NakodaBhairavChalisaProps) {
  return (
    <div className={styles['container']}>
      <p>
        <div className={styles['header']}>Nakoda Bhairav Chalisa</div>
      </p>

      <div className={styles['body']}>
        <div> ॥ दोहा ॥ </div>
        <div>
          पाश्वर्नाथ भगवान की, मूरत चित बसाए ॥ भैरव चालीसा लखू, गाता मन हरसाए ॥{' '}
        </div>
        <br />
        <div>।। चौपाई ।। </div>
        <div>नाकोडा भैरव सुखकारी, गुण गाये ये दुनिया सारी ॥ </div>
        <div>भैरव की महिमा अति भारी, भैरव नाम जपे नर – नारी ॥ </div>
        <div>जिनवर के हैं आज्ञाकारी, श्रद्धा रखते समकित धारी ॥ </div>
        <div>प्रातः उठ जो भैरव ध्याता, ऋद्धि सिद्धि सब संपत्ति पाता ॥ </div>
        <div>भैरव नाम जपे जो कोई, उस घर में निज मंगल होई ॥ </div>
        <div>नाकोडा लाखों नर आवे, श्रद्धा से परसाद चढावे ॥ </div>
        <div>भैरव – भैरव आन पुकारे, भक्तों के सब कष्ट निवारे ॥ </div>
        <div>भैरव दर्शन शक्ति – शाली, दर से कोई न जावे खाली ॥ </div>
        <div>जो नर नित उठ तुमको ध्यावे, भूत पास आने नहीं पावे ॥ </div>
        <div>डाकण छूमंतर हो जावे, दुष्ट देव आडे नहीं आवे ॥ </div>
        <div>मारवाड की दिव्य मणि हैं, हम सब के तो आप धणी हैं ॥ </div>
        <div>कल्पतरु है परतिख भैरव, इच्छित देता सबको भैरव ॥ </div>
        <div>आधि व्याधि सब दोष मिटावे, सुमिरत भैरव शान्ति पावे ॥ </div>
        <div>बाहर परदेशे जावे नर, नाम मंत्र भैरव का लेकर ॥ </div>
        <div>चोघडिया दूषण मिट जावे, काल राहु सब नाठा जावे ॥ </div>
        <div>परदेशा में नाम कमावे, धन बोरा में भरकर लावे ॥ </div>
        <div>तन में साता मन में साता, जो भैरव को नित्य मनाता ॥ </div>
        <div>मोटा डूंगर रा रहवासी, अर्ज सुणन्ता दौड्या आसी ॥ </div>
        <div>जो नर भक्ति से गुण गासी, पावें नव रत्नों की राशि ॥ </div>
        <div>श्रद्धा से जो शीष झुकावे, भैरव अमृत रस बरसावे ॥ </div>
        <div>मिल जुल सब नर फेरे माला, दौड्या आवे बादल – काला ॥ </div>
        <div>वर्षा री झडिया बरसावे, धरती माँ री प्यास बुझावे ॥ </div>
        <div>अन्न – संपदा भर भर पावे, चारों ओर सुकाल बनावे ॥ </div>
        <div>भैरव है सच्चा रखवाला, दुश्मन मित्र बनाने वाला ॥ </div>
        <div>देश – देश में भैरव गाजे, खूटँ – खूटँ में डंका बाजे ॥ </div>
        <div>हो नहीं अपना जिनके कोई, भैरव सहायक उनके होई ॥ </div>
        <div>नाभि केन्द्र से तुम्हें बुलावे, भैरव झट – पट दौडे आवे ॥ </div>
        <div>भूख्या नर की भूख मिटावे, प्यासे नर को नीर पिलावे ॥ </div>
        <div>इधर – उधर अब नहीं भटकना, भैरव के नित पाँव पकडना ॥ </div>
        <div>इच्छित संपदा आप मिलेगी, सुख की कलियाँ नित्य खिलेंगी ॥ </div>
        <div>भैरव गण खरतर के देवा, सेवा से पाते नर मेवा ॥ </div>
        <div>कीर्तिरत्न की आज्ञा पाते, हुक्म – हाजिरी सदा बजाते ॥ </div>
        <div>ऊँ ह्रीं भैरव बं बं भैरव, कष्ट निवारक भोला भैरव ॥ </div>
        <div>नैन मूँद धुन रात लगावे, सपने में वो दर्शन पावे ॥ </div>
        <div>प्रश्नों के उत्तर झट मिलते, रस्ते के संकट सब मिटते ॥ </div>
        <div>नाकोडा भैरव नित ध्यावो, संकट मेटो मंगल पावो ॥ </div>
        <div>भैरव जपन्ता मालम – माला, बुझ जाती दुःखों की ज्वाला ॥ </div>
        <div>नित उठे जो चालीसा गावे, धन सुत से घर स्वर्ग बनावे ॥ </div>
        <div>॥ दोहा ॥ </div>
        <div>भैरु चालीसा पढे, मन में श्रद्धा धार ।</div>
        <div> कष्ट कटे महिमा बढे, संपदा होत अपार ॥ </div>
        <div>जिन कान्ति गुरुराज के,शिष्य मणिप्रभ राय । </div>
        <div>भैरव के सानिध्य में,ये चालीसा गाय ॥ </div>
        <div>॥ श्री भैरवाय शरणम् ॥</div>
      </div>
    </div>
  );
}

export default NakodaBhairavChalisa;
